SantiniAmedeoVentiEdoardo/incompressibleFlow/combustorPisoBlown/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

deltaT		1e-6;

stopAt          endTime;

endTime         1;

adjustTimeStep	yes;

maxCo		0.8;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
	#includeFunc	residuals(p,U,k,epsilon)
	
	force
	{
		type		forces;
		enabled		yes;
		libs		("libforces.so");
		log		yes;
		patches		(splitter back fuel_inlet);
		rho		rhoInf;
		rhoInf		1.18;

		writeControl	timeStep;
		writeInterval	1;

		liftDir		(1 0 0);
		dragDir		(0 1 0);
		CofR		(0 0 0);
	}
	
	pInlet
	{
		type		surfaceFieldValue;
		enabled		yes;
		log		true;
				
		writeControl	timeStep;
		writeInterval	1;

		regionType	patch;
		writeFields	no;
		name		inlet;
		operation	average;
		fields		(p);

		libs		("libfieldFunctionObjects.so");
	}
	yPlus
        {
                type            yPlus;
                libs            ("libfieldFunciotnObjects.so");
                wrtiePrecision  6;
                writeControl    writeTime;
                writeInterval   1;
                writeToFile     false;
                log             true;
        }
	fieldAverage1
	{
		// Mandatory entries (unmodifiable)
		type	fieldAverage;
		libs	("libfieldFunctionObjects.so");

		// Mandatory entries (runtime modifiable)
		fields
		(
		       U
        {
            mean                true;
            prime2Mean          true;
            base                time;
            windowType          exact;
            window              0.2;
            allowRestart        true;
        }
        k
        {
                mean            true;
                prime2Mean      true;
                base            time;
                windowType      exact;
                window          0.2;
                allowRestart    true;

        }
        p
        {
                mean            true;
                prime2Mean      true;
                base            time;
                windowType      exact;
                window          0.2;
                allowRestart    true;

        }

        );

        // Optional entries (runtime modifiable)
        restartOnRestart    false;
        restartOnOutput     false;
        periodicRestart     false;
        restartPeriod       0.002;

        // Optional (inherited) entries
        enabled         true;
        log             false;
        timeStart       0.3;
        timeEnd         1.0;
        writeControl    writeTime;
        writeInterval   1;
        }

}
